# Створи клас Animal.
# 1) Опиши конструктор класу. 
# Він повинен створювати екземпляр із двома властивостями: вид (наприклад, «собака») та голос (наприклад, «Гав!»).
# 2) Додай до класу метод make_voice(), який повинен друкувати на екран голос тварини.
# 3) Створи екземпляр класу: собаку з голосом 'Гав!'. 
# Надрукуй загальну інформацію про неї (ця команда вже дана в рівні) і зроби так, щоб собака подав голос.

class Animal():
    #конструктор класу
    def __init__(self, species, voice):
        self.species = species
        self.voice = voice

    #метод "Голос"
    def make_voice(self):
        print("Гав!")

#створення екземпляра класу my_animal
my_animal = Animal("собака", "Гав!")


print('Я - робот-' + my_animal.species + '. Я знаю команду Голос:')
my_animal.make_voice()