# Запрограмуй клас Rectangle(прямокутник):
# 1) Створи конструктор класу. Він повинен створювати прямокутник із властивостями: довжина та ширина (вводяться з клавіатури).
# 2) Створи метод, який друкує інформацію про фігуру. Він повинен виводити дані: Даний прямокутник з довжиною _ і шириною _ .
# 3) Створи метод, що обчислює та повертає периметр прямокутника.
# 4) Створи метод, що обчислює та повертає площу прямокутника.
# Запроси з клавіатури довжину та ширину прямокутника та створи відповідний екземпляр класу Rectangle. Надрукуй інформацію про об'єкт. 
# Потім обчисли і надрукуй периметр (з позначкою «Його периметр: _») та площу (з позначкою: «Його площа: _»).

#опис класу Rectangle
class Rectangle():
    
    def __init__(self, length, width):
        self.length = length
        self.width = width
        
    def inform(self):
        print(f"Даний прямокутник з довжиною {self.length} і шириною {self.width}")
    
    def perimetr(self):
        p = (self.width + self.length) * 2
        print(p)
    
    def area(self):
        s = self.width * self.length
        print(s)

#введення довжини та ширини та створення екземпляра класу
rectangle = Rectangle(int(input("Введіть ширину прямокутника: ")), int(input("Введіть довжину прямокутника: ")))


#друк інформації про прямокутник
rectangle.inform()

#підрахунок та друк периметра
rectangle.perimetr()

#підрахунок та друк площі
rectangle.area()